DeviceImageLoadEvents
| extend FileName = tolower(FileName), FolderPath = tolower(FolderPath), InitiatingProcessFileName = tolower(InitiatingProcessFileName)
| where Filename == "commfunc.dll"
| where not(FolderPath contains "c:\\program files\\lenovo\\communications utility") and (InitiatingProcessFileName endswith "cammute.exe")
| invoke FileProfile("SHA1", 1000)
