DeviceImageLoadEvents
| extend FileName = tolower(FileName), FolderPath = tolower(FolderPath), InitiatingProcessFileName = tolower(InitiatingProcessFileName)
| where Filename == "dbghelp.dll"
| where not(FolderPath contains "c:\\program files\\windows kits\\10\\debuggers\\arm" or FolderPath contains "c:\\program files\\windows kits\\10\\debuggers\\arm\\srcsrv" or FolderPath contains "c:\\program files\\windows kits\\10\\debuggers\\arm64" or FolderPath contains "c:\\program files\\windows kits\\10\\debuggers\\arm64\\srcsrv" or FolderPath contains "c:\\program files\\windows kits\\10\\debuggers\\x64" or FolderPath contains "c:\\program files\\windows kits\\10\\debuggers\\x64\\srcsrv" or FolderPath contains "c:\\program files\\windows kits\\10\\debuggers\\x86" or FolderPath contains "c:\\program files\\windows kits\\10\\debuggers\\x86\\srcsrv" or FolderPath contains "c:\\program files\\cisco systems\\cisco jabber" or FolderPath contains "c:\\program files\\microsoft office\\root\\office" or FolderPath contains "c:\\program files\\microsoft office\\root\\vfs\\programfilesx86\\microsoft analysis services\\as oledb\\140" or FolderPath contains "c:\\windows\\system32" or FolderPath contains "c:\\windows\\syswow64") and (InitiatingProcessFileName endswith "bootim.exe" or InitiatingProcessFileName endswith "dxcap.exe" or InitiatingProcessFileName endswith "taskkill.exe" or InitiatingProcessFileName endswith "tasklist.exe" or InitiatingProcessFileName endswith "tracerpt.exe" or InitiatingProcessFileName endswith "werfault.exe" or InitiatingProcessFileName endswith "bdehdcfg.exe" or InitiatingProcessFileName endswith "deploymentcsphelper.exe" or InitiatingProcessFileName endswith "djoin.exe" or InitiatingProcessFileName endswith "dnscacheugc.exe" or InitiatingProcessFileName endswith "ieunatt.exe" or InitiatingProcessFileName endswith "muiunattend.exe" or InitiatingProcessFileName endswith "netbtugc.exe" or InitiatingProcessFileName endswith "netiougc.exe" or InitiatingProcessFileName endswith "pnpunattend.exe" or InitiatingProcessFileName endswith "reagentc.exe" or InitiatingProcessFileName endswith "setupugc.exe")
| invoke FileProfile("SHA1", 1000)
