DeviceImageLoadEvents
| extend FileName = tolower(FileName), FolderPath = tolower(FolderPath), InitiatingProcessFileName = tolower(InitiatingProcessFileName)
| where Filename == "fvewiz.dll"
| where not(FolderPath contains "c:\\windows\\system32") and (InitiatingProcessFileName endswith "bitlockerwizard.exe" or InitiatingProcessFileName endswith "bitlockerwizardelev.exe")
| invoke FileProfile("SHA1", 1000)
