DeviceImageLoadEvents
| extend FileName = tolower(FileName), FolderPath = tolower(FolderPath), InitiatingProcessFileName = tolower(InitiatingProcessFileName)
| where Filename == "regapi.dll"
| where not(FolderPath contains "c:\\windows\\system32" or FolderPath contains "c:\\windows\\syswow64") and (InitiatingProcessFileName endswith "change.exe" or InitiatingProcessFileName endswith "chglogon.exe" or InitiatingProcessFileName endswith "query.exe" or InitiatingProcessFileName endswith "reset.exe")
| invoke FileProfile("SHA1", 1000)
