DeviceImageLoadEvents
| extend FileName = tolower(FileName), FolderPath = tolower(FolderPath), InitiatingProcessFileName = tolower(InitiatingProcessFileName)
| where Filename == "samcli.dll"
| where not(FolderPath contains "c:\\windows\\system32" or FolderPath contains "c:\\windows\\syswow64") and (InitiatingProcessFileName endswith "certutil.exe" or InitiatingProcessFileName endswith "change.exe" or InitiatingProcessFileName endswith "chglogon.exe" or InitiatingProcessFileName endswith "chgport.exe" or InitiatingProcessFileName endswith "credwiz.exe" or InitiatingProcessFileName endswith "dcdiag.exe" or InitiatingProcessFileName endswith "deviceenroller.exe" or InitiatingProcessFileName endswith "dpapimig.exe" or InitiatingProcessFileName endswith "easinvoker.exe" or InitiatingProcessFileName endswith "net.exe" or InitiatingProcessFileName endswith "net1.exe" or InitiatingProcessFileName endswith "netdom.exe" or InitiatingProcessFileName endswith "netplwiz.exe" or InitiatingProcessFileName endswith "query.exe" or InitiatingProcessFileName endswith "quser.exe" or InitiatingProcessFileName endswith "qwinsta.exe" or InitiatingProcessFileName endswith "raserver.exe" or InitiatingProcessFileName endswith "reset.exe" or InitiatingProcessFileName endswith "rwinsta.exe" or InitiatingProcessFileName endswith "systemsettingsadminflows.exe" or InitiatingProcessFileName endswith "tscon.exe" or InitiatingProcessFileName endswith "tskill.exe" or InitiatingProcessFileName endswith "wpcmon.exe")
| invoke FileProfile("SHA1", 1000)
