DeviceImageLoadEvents
| extend FileName = tolower(FileName), FolderPath = tolower(FolderPath), InitiatingProcessFileName = tolower(InitiatingProcessFileName)
| where Filename == "srpapi.dll"
| where not(FolderPath contains "c:\\windows\\system32" or FolderPath contains "c:\\windows\\syswow64") and (InitiatingProcessFileName endswith "appidpolicyconverter.exe" or InitiatingProcessFileName endswith "mshta.exe" or InitiatingProcessFileName endswith "rdpclip.exe")
| invoke FileProfile("SHA1", 1000)
